malcolm-sparkfun/micropython/ports/mimxrt/mimxrt_csi.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2025 Malcolm McKellips
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include "py/runtime.h"
#include "py/mphal.h"
#include "modmimxrt.h"

#include "fsl_csi.h" 

// Following pattern from HSTX driver of rp2 port

// Default regs, see nxp_driver/sdk/drivers/csi/fsl_csi.c in CSI_Reset() and i.MX RT1060 Reference Manual Register Map
#define DEFAULT_CSI_CR1 (CSI_CR1_HSYNC_POL_MASK | CSI_CR1_EXT_VSYNC_MASK)
#define DEFAULT_CSI_CR2 (0u)
#define DEFAULT_CSI_CR3 (0u)

#if defined(CSI_CR18_CSI_LCDIF_BUFFER_LINES)
    #define DEFAULT_CSI_CR18 (CSI_CR18_AHB_HPROT(0x0DU) | CSI_CR18_CSI_LCDIF_BUFFER_LINES(0x02U))
#else
    #define DEFAULT_CSI_CR18 (CSI_CR18_AHB_HPROT(0x0DU))
#endif

#define DEFAULT_CSI_REG_FBUF_PARA (0u)
#define DEFAULT_CSI_REG_IMAG_PARA (0u)

// Base Objects
typedef struct _mimxrt_csi_obj_t {
    mp_obj_base_t base;
    // CSI_Type *csi_inst;
    // uint8_t csi_id;
} mimxrt_csi_obj_t;

typedef struct _mimxrt_csi_field_t {
    qstr name;
    uint8_t shift: 5; // max shift of 31
    uint8_t length: 6; // max 63 bits wide per field of each reg (even though 32 is the max reg size)
} mimxrt_csi_field_t;

static mimxrt_csi_field_t mimxrt_csi_cr1_fields_table[] = {
    { MP_QSTR_PIXEL_BIT, CSI_CR1_PIXEL_BIT_SHIFT, 1},
    { MP_QSTR_REDGE, CSI_CR1_REDGE_SHIFT, 1},
    { MP_QSTR_INV_PCLK, CSI_CR1_INV_PCLK_SHIFT, 1},
    { MP_QSTR_INV_DATA, CSI_CR1_INV_DATA_SHIFT, 1},
    { MP_QSTR_GCLK_MODE, CSI_CR1_GCLK_MODE_SHIFT, 1},
    { MP_QSTR_CLR_RXFIFO, CSI_CR1_CLR_RXFIFO_SHIFT, 1},
    { MP_QSTR_CLR_STATFIFO, CSI_CR1_CLR_STATFIFO_SHIFT, 1},
    { MP_QSTR_PACK_DIR, CSI_CR1_PACK_DIR_SHIFT, 1},
    { MP_QSTR_FCC, CSI_CR1_FCC_SHIFT, 1},
    { MP_QSTR_CCIR_EN, CSI_CR1_CCIR_EN_SHIFT, 1},
    { MP_QSTR_HSYNC_POL, CSI_CR1_HSYNC_POL_SHIFT, 1},
    { MP_QSTR_SOF_INTEN, CSI_CR1_SOF_INTEN_SHIFT, 1},
    { MP_QSTR_SOF_POL, CSI_CR1_SOF_POL_SHIFT, 1},
    { MP_QSTR_RXFF_INTEN, CSI_CR1_RXFF_INTEN_SHIFT, 1},
    { MP_QSTR_FB1_DMA_DONE_INTEN, CSI_CR1_FB1_DMA_DONE_INTEN_SHIFT, 1},
    { MP_QSTR_FB2_DMA_DONE_INTEN, CSI_CR1_FB2_DMA_DONE_INTEN_SHIFT, 1},
    { MP_QSTR_STATFF_INTEN, CSI_CR1_STATFF_INTEN_SHIFT, 1},
    { MP_QSTR_SFF_DMA_DONE_INTEN, CSI_CR1_SFF_DMA_DONE_INTEN_SHIFT, 1},
    { MP_QSTR_RF_OR_INTEN, CSI_CR1_RF_OR_INTEN_SHIFT, 1},
    { MP_QSTR_SF_OR_INTEN, CSI_CR1_SF_OR_INTEN_SHIFT, 1},
    { MP_QSTR_COF_INT_EN, CSI_CR1_COF_INT_EN_SHIFT, 1},
    { MP_QSTR_CCIR_MODE, CSI_CR1_CCIR_MODE_SHIFT, 1},
    { MP_QSTR_PrP_IF_EN, CSI_CR1_PrP_IF_EN_SHIFT, 1},
    { MP_QSTR_EOF_INT_EN, CSI_CR1_EOF_INT_EN_SHIFT, 1},
    { MP_QSTR_EXT_VSYNC, CSI_CR1_EXT_VSYNC_SHIFT, 1},
    { MP_QSTR_SWAP16_EN, CSI_CR1_SWAP16_EN_SHIFT, 1},
};

static const uint32_t mimxrt_csi_cr1_field_count = MP_ARRAY_SIZE(mimxrt_csi_cr1_fields_table);

static mimxrt_csi_field_t mimxrt_csi_cr2_fields_table[] = {
    { MP_QSTR_HSC, CSI_CR2_HSC_SHIFT, 8},
    {MP_QSTR_VSC, CSI_CR2_VSC_SHIFT, 8},
    { MP_QSTR_LVRM, CSI_CR2_LVRM_SHIFT, 3},
    { MP_QSTR_BTS, CSI_CR2_BTS_SHIFT, 2},
    { MP_QSTR_SCE, CSI_CR2_SCE_SHIFT, 1},
    { MP_QSTR_AFS, CSI_CR2_AFS_SHIFT, 2},
    { MP_QSTR_DRM, CSI_CR2_DRM_SHIFT, 1},
    { MP_QSTR_DMA_BURST_TYPE_SFF, CSI_CR2_DMA_BURST_TYPE_SFF_SHIFT, 2},
    { MP_QSTR_DMA_BURST_TYPE_RFF, CSI_CR2_DMA_BURST_TYPE_RFF_SHIFT, 2},
};

static const uint32_t mimxrt_csi_cr2_field_count = MP_ARRAY_SIZE(mimxrt_csi_cr2_fields_table);

static mimxrt_csi_field_t mimxrt_csi_cr3_fields_table[] = {
    { MP_QSTR_ECC_AUTO_EN, CSI_CR3_ECC_AUTO_EN_SHIFT, 1},
    { MP_QSTR_ECC_INT_EN, CSI_CR3_ECC_INT_EN_SHIFT, 1},
    { MP_QSTR_ZERO_PACK_EN, CSI_CR3_ZERO_PACK_EN_SHIFT, 1},
    { MP_QSTR_SENSOR_16BITS, CSI_CR3_SENSOR_16BITS_SHIFT, 1},
    { MP_QSTR_RxFF_LEVEL, CSI_CR3_RxFF_LEVEL_SHIFT, 3},
    { MP_QSTR_HRESP_ERR_EN, CSI_CR3_HRESP_ERR_EN_SHIFT, 1},
    { MP_QSTR_STATFF_LEVEL, CSI_CR3_STATFF_LEVEL_SHIFT, 3},
    { MP_QSTR_DMA_REQ_EN_SFF, CSI_CR3_DMA_REQ_EN_SFF_SHIFT, 1},
    { MP_QSTR_DMA_REQ_EN_RFF, CSI_CR3_DMA_REQ_EN_RFF_SHIFT, 1},
    { MP_QSTR_DMA_REFLASH_SFF, CSI_CR3_DMA_REFLASH_SFF_SHIFT, 1},
    { MP_QSTR_DMA_REFLASH_RFF, CSI_CR3_DMA_REFLASH_RFF_SHIFT, 1},
    { MP_QSTR_FRMCNT_RST, CSI_CR3_FRMCNT_RST_SHIFT, 1},
    { MP_QSTR_FRMCNT, CSI_CR3_FRMCNT_SHIFT, 16},
};

static const uint32_t mimxrt_csi_cr3_field_count = MP_ARRAY_SIZE(mimxrt_csi_cr3_fields_table);

static mimxrt_csi_field_t mimxrt_csi_rxcnt_fields_table[] = {
    { MP_QSTR_RXCNT, CSI_RXCNT_RXCNT_SHIFT, 22},
};

static const uint32_t mimxrt_csi_rxcnt_field_count = MP_ARRAY_SIZE(mimxrt_csi_rxcnt_fields_table);

static mimxrt_csi_field_t mimxrt_csi_sr_fields_table[] = {
    { MP_QSTR_DRDY, CSI_SR_DRDY_SHIFT, 1},
    { MP_QSTR_ECC_INT, CSI_SR_ECC_INT_SHIFT, 1},
    { MP_QSTR_HRESP_ERR_INT, CSI_SR_HRESP_ERR_INT_SHIFT, 1},
    { MP_QSTR_COF_INT, CSI_SR_COF_INT_SHIFT, 1},
    { MP_QSTR_F1_INT, CSI_SR_F1_INT_SHIFT, 1},
    { MP_QSTR_F2_INT, CSI_SR_F2_INT_SHIFT, 1},
    { MP_QSTR_SOF_INT, CSI_SR_SOF_INT_SHIFT, 1},
    { MP_QSTR_EOF_INT, CSI_SR_EOF_INT_SHIFT, 1},
    { MP_QSTR_RxFF_INT, CSI_SR_RxFF_INT_SHIFT, 1},
    { MP_QSTR_DMA_TSF_DONE_FB1, CSI_SR_DMA_TSF_DONE_FB1_SHIFT, 1},
    { MP_QSTR_DMA_TSF_DONE_FB2, CSI_SR_DMA_TSF_DONE_FB2_SHIFT, 1},
    { MP_QSTR_STATFF_INT, CSI_SR_STATFF_INT_SHIFT, 1},
    { MP_QSTR_DMA_TSF_DONE_SFF, CSI_SR_DMA_TSF_DONE_SFF_SHIFT, 1},
    { MP_QSTR_RF_OR_INT, CSI_SR_RF_OR_INT_SHIFT, 1},
    { MP_QSTR_SF_OR_INT, CSI_SR_SF_OR_INT_SHIFT, 1},
    { MP_QSTR_DMA_FIELD1_DONE, CSI_SR_DMA_FIELD1_DONE_SHIFT, 1},
    { MP_QSTR_DMA_FIELD0_DONE, CSI_SR_DMA_FIELD0_DONE_SHIFT, 1},
    { MP_QSTR_BASEADDR_CHHANGE_ERROR, CSI_SR_BASEADDR_CHHANGE_ERROR_SHIFT, 1},
};

