malcolm-sparkfun/micropython/ports/mimxrt/mimxrt_csi.c
static const uint32_t mimxrt_csi_sr_field_count = MP_ARRAY_SIZE(mimxrt_csi_sr_fields_table);

static mimxrt_csi_field_t mimxrt_csi_dmasa_statfifo_fields_table[] = {
    { MP_QSTR_DMA_START_ADDR_SFF, CSI_DMASA_STATFIFO_DMA_START_ADDR_SFF_SHIFT, 30},
};

static const uint32_t mimxrt_csi_dmasa_statfifo_field_count = MP_ARRAY_SIZE(mimxrt_csi_dmasa_statfifo_fields_table);

static mimxrt_csi_field_t mimxrt_csi_dmats_statfifo_fields_table[] = {
    { MP_QSTR_DMA_TSF_SIZE_SFF, CSI_DMATS_STATFIFO_DMA_TSF_SIZE_SFF_SHIFT, 32},
};

static const uint32_t mimxrt_csi_dmats_statfifo_field_count = MP_ARRAY_SIZE(mimxrt_csi_dmats_statfifo_fields_table);

static mimxrt_csi_field_t mimxrt_csi_dmasa_fb1_fields_table[] = {
    { MP_QSTR_DMA_START_ADDR_FB1, CSI_DMASA_FB1_DMA_START_ADDR_FB1_SHIFT, 30},
};

static const uint32_t mimxrt_csi_dmasa_fb1_field_count = MP_ARRAY_SIZE(mimxrt_csi_dmasa_fb1_fields_table);

static mimxrt_csi_field_t mimxrt_csi_dmasa_fb2_fields_table[] = {
    { MP_QSTR_DMA_START_ADDR_FB2, CSI_DMASA_FB2_DMA_START_ADDR_FB2_SHIFT, 30},
};

static const uint32_t mimxrt_csi_dmasa_fb2_field_count = MP_ARRAY_SIZE(mimxrt_csi_dmasa_fb2_fields_table);

static mimxrt_csi_field_t mimxrt_csi_fbuf_para_fields_table[] = {
    { MP_QSTR_FBUF_STRIDE_SHIFT, CSI_FBUF_PARA_FBUF_STRIDE_SHIFT, 16},
    { MP_QSTR_DEINTERLACE_STRIDE, CSI_FBUF_PARA_DEINTERLACE_STRIDE_SHIFT, 16},
};

static const uint32_t mimxrt_csi_fbuf_para_field_count = MP_ARRAY_SIZE(mimxrt_csi_fbuf_para_fields_table);

static mimxrt_csi_field_t mimxrt_csi_imag_para_fields_table[] = {
    { MP_QSTR_IMAGE_HEIGHT, CSI_IMAG_PARA_IMAGE_HEIGHT_SHIFT, 16},
    { MP_QSTR_IMAGE_WIDTH, CSI_IMAG_PARA_IMAGE_WIDTH_SHIFT, 16},
};

static const uint32_t mimxrt_csi_imag_para_field_count = MP_ARRAY_SIZE(mimxrt_csi_imag_para_fields_table);

static mimxrt_csi_field_t mimxrt_csi_cr18_fields_table[] = {
    { MP_QSTR_DEINTERLACE_EN, CSI_CR18_DEINTERLACE_EN_SHIFT, 1},
    { MP_QSTR_PARALLEL24_EN, CSI_CR18_PARALLEL24_EN_SHIFT, 1},
    { MP_QSTR_BASEADDR_SWITCH_EN, CSI_CR18_BASEADDR_SWITCH_EN_SHIFT, 1},
    { MP_QSTR_BASEADDR_SWITCH_SEL, CSI_CR18_BASEADDR_SWITCH_SEL_SHIFT, 1},
    { MP_QSTR_FIELD0_DONE_IE, CSI_CR18_FIELD0_DONE_IE_SHIFT, 1},
    { MP_QSTR_DMA_FIELD1_DONE_IE, CSI_CR18_DMA_FIELD1_DONE_IE_SHIFT, 1},
    { MP_QSTR_LAST_DMA_REQ_SEL, CSI_CR18_LAST_DMA_REQ_SEL_SHIFT, 1},
    { MP_QSTR_BASEADDR_CHANGE_ERROR_IE, CSI_CR18_BASEADDR_CHANGE_ERROR_IE_SHIFT, 1},
    { MP_QSTR_RGB888A_FORMAT_SEL, CSI_CR18_RGB888A_FORMAT_SEL_SHIFT, 1},
    { MP_QSTR_AHB_HPROT, CSI_CR18_AHB_HPROT_SHIFT, 4},
    { MP_QSTR_MASK_OPTION, CSI_CR18_MASK_OPTION_SHIFT, 2},
    { MP_QSTR_CSI_ENABLE, CSI_CR18_CSI_ENABLE_SHIFT, 1},
};

static const uint32_t mimxrt_csi_cr18_field_count = MP_ARRAY_SIZE(mimxrt_csi_cr18_fields_table);

static mimxrt_csi_field_t mimxrt_csi_cr19_fields_table[] = {
    { MP_QSTR_DMA_RFIFO_HIGHEST_FIFO_LEVEL, CSI_CR19_DMA_RFIFO_HIGHEST_FIFO_LEVEL_SHIFT, 3},
};

static const uint32_t mimxrt_csi_cr19_field_count = MP_ARRAY_SIZE(mimxrt_csi_cr19_fields_table);

// TODO: Lift these from the driver implementation?
void mimxrt_csi_init(void) {
    // Initialize CSI hardware here
}

void mimxrt_csi_deinit(void) {
    // Deinitialize CSI hardware here
}

/*********************************************************************/
// MIMXT object
static mimxrt_csi_obj_t mimxrt_csi_obj = {
    .base = { &mimxrt_csi_type }
};

static mp_obj_t mimxrt_csi_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    return MP_OBJ_FROM_PTR(&mimxrt_csi_obj);
}

// static mp_obj_t mimxrt_csi_foo(mp_obj_t self_in) {
//     // print("foo called\n");
//     // mp_printf("foo called\n");
//     mp_raise_msg_varg(&mp_type_OSError, MP_ERROR_TEXT("FOO CALLED"));
//     return mp_const_none;
// }
// static MP_DEFINE_CONST_FUN_OBJ_1(mimxrt_csi_foo_obj, mimxrt_csi_foo);

// ------------------------------- Register Setting and Reading Functions -------------------------------
// CSI.cr1([value])
static mp_obj_t mimxrt_csi_cr1(size_t n_args, const mp_obj_t *args) {
    if (n_args > 1) {
        mp_int_t value = mp_obj_get_int(args[1]);
        CSI->CR1 = value;
        return mp_const_none;
    }
    return mp_obj_new_int_from_uint(CSI->CR1);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mimxrt_csi_cr1_obj, 1, 2, mimxrt_csi_cr1);

// CSI.cr2([value])
static mp_obj_t mimxrt_csi_cr2(size_t n_args, const mp_obj_t *args) {
    if (n_args > 1) {
        mp_int_t value = mp_obj_get_int(args[1]);
        CSI->CR2 = value;
        return mp_const_none;
    }
    return mp_obj_new_int_from_uint(CSI->CR2);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mimxrt_csi_cr2_obj, 1, 2, mimxrt_csi_cr2);

// CSI.cr3([value])
static mp_obj_t mimxrt_csi_cr3(size_t n_args, const mp_obj_t *args) {
    if (n_args > 1) {
        mp_int_t value = mp_obj_get_int(args[1]);
        CSI->CR3 = value;
        return mp_const_none;
    }
    return mp_obj_new_int_from_uint(CSI->CR3);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mimxrt_csi_cr3_obj, 1, 2, mimxrt_csi_cr3);

// CSI.statfifo() <Read only>
static mp_obj_t mimxrt_csi_statfifo(mp_obj_t self_in) {
    return mp_obj_new_int_from_uint(CSI->STATFIFO);
}
static MP_DEFINE_CONST_FUN_OBJ_1(mimxrt_csi_statfifo_obj, mimxrt_csi_statfifo);

// CSI.rfifo() <>Read only>
static mp_obj_t mimxrt_csi_rfifo(mp_obj_t self_in) {
    return mp_obj_new_int_from_uint(CSI->RFIFO);
}
static MP_DEFINE_CONST_FUN_OBJ_1(mimxrt_csi_rfifo_obj, mimxrt_csi_rfifo);

// CSI.rxcnt([value])
static mp_obj_t mimxrt_csi_rxcnt(size_t n_args, const mp_obj_t *args) {
    if (n_args > 1) {
        mp_int_t value = mp_obj_get_int(args[1]);
        CSI->RXCNT = value;
        return mp_const_none;
    }
    return mp_obj_new_int_from_uint(CSI->RXCNT);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mimxrt_csi_rxcnt_obj, 1, 2, mimxrt_csi_rxcnt);

// CSI.sr([value])
static mp_obj_t mimxrt_csi_sr(size_t n_args, const mp_obj_t *args) {
    if (n_args > 1) {
        mp_int_t value = mp_obj_get_int(args[1]);
        CSI->SR = value;
        return mp_const_none;
    }
    return mp_obj_new_int_from_uint(CSI->SR);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mimxrt_csi_sr_obj, 1, 2, mimxrt_csi_sr);

// CSI.dmasa_statfifo([value])
static mp_obj_t mimxrt_csi_dmasa_statfifo(size_t n_args, const mp_obj_t *args) {
    if (n_args > 1) {
        mp_int_t value = mp_obj_get_int(args[1]);
        CSI->DMASA_STATFIFO = value;
        return mp_const_none;
    }
    return mp_obj_new_int_from_uint(CSI->DMASA_STATFIFO);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mimxrt_csi_dmasa_statfifo_obj, 1, 2, mimxrt_csi_dmasa_statfifo);

// CSI.dmats_statfifo([value])
static mp_obj_t mimxrt_csi_dmats_statfifo(size_t n_args, const mp_obj_t *args) {
    if (n_args > 1) {
        mp_int_t value = mp_obj_get_int(args[1]);
        CSI->DMATS_STATFIFO = value;
        return mp_const_none;
    }
    return mp_obj_new_int_from_uint(CSI->DMATS_STATFIFO);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mimxrt_csi_dmats_statfifo_obj, 1, 2, mimxrt_csi_dmats_statfifo);

// CSI.dmasa_fb1([value])
static mp_obj_t mimxrt_csi_dmasa_fb1(size_t n_args, const mp_obj_t *args) {
    if (n_args > 1) {
        mp_int_t value = mp_obj_get_int(args[1]);
        CSI->DMASA_FB1 = value;
        return mp_const_none;
    }
    return mp_obj_new_int_from_uint(CSI->DMASA_FB1);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mimxrt_csi_dmasa_fb1_obj, 1, 2, mimxrt_csi_dmasa_fb1);

// CSI.dmasa_fb2([value])
static mp_obj_t mimxrt_csi_dmasa_fb2(size_t n_args, const mp_obj_t *args) {
    if (n_args > 1) {
        mp_int_t value = mp_obj_get_int(args[1]);
        CSI->DMASA_FB2 = value;
        return mp_const_none;
    }
    return mp_obj_new_int_from_uint(CSI->DMASA_FB2);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mimxrt_csi_dmasa_fb2_obj, 1, 2, mimxrt_csi_dmasa_fb2);

// CSI.fbuf_para([value])
static mp_obj_t mimxrt_csi_fbuf_para(size_t n_args, const mp_obj_t *args) {
    if (n_args > 1) {
        mp_int_t value = mp_obj_get_int(args[1]);
        CSI->FBUF_PARA = value;
        return mp_const_none;
    }
    return mp_obj_new_int_from_uint(CSI->FBUF_PARA);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mimxrt_csi_fbuf_para_obj, 1, 2, mimxrt_csi_fbuf_para);

// CSI.imag_para([value])
static mp_obj_t mimxrt_csi_imag_para(size_t n_args, const mp_obj_t *args) {
    if (n_args > 1) {
        mp_int_t value = mp_obj_get_int(args[1]);
        CSI->IMAG_PARA = value;
        return mp_const_none;
    }
    return mp_obj_new_int_from_uint(CSI->IMAG_PARA);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mimxrt_csi_imag_para_obj, 1, 2, mimxrt_csi_imag_para);

// CSI.cr18([value])
static mp_obj_t mimxrt_csi_cr18(size_t n_args, const mp_obj_t *args) {
    if (n_args > 1) {
        mp_int_t value = mp_obj_get_int(args[1]);
        CSI->CR18 = value;
        return mp_const_none;
    }
    return mp_obj_new_int_from_uint(CSI->CR18);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mimxrt_csi_cr18_obj, 1, 2, mimxrt_csi_cr18);

// CSI.cr19([value])
static mp_obj_t mimxrt_csi_cr19(size_t n_args, const mp_obj_t *args) {
    if (n_args > 1) {
        mp_int_t value = mp_obj_get_int(args[1]);
        CSI->CR19 = value;
        return mp_const_none;
    }
    return mp_obj_new_int_from_uint(CSI->CR19);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mimxrt_csi_cr19_obj, 1, 2, mimxrt_csi_cr19);

static mp_obj_t mimxrt_csi_pack_reg(size_t n_pos_args, mp_map_t *kw_args, mp_uint_t default_value, mimxrt_csi_field_t *fields_table, uint32_t field_count) {
    // Pack keyword settings into a control register value
    mp_uint_t value = default_value;

    if (n_pos_args > 1) {
        mp_raise_TypeError(MP_ERROR_TEXT("only keyword arguments are allowed"));
    }
    mp_uint_t remaining = kw_args->used;

    mp_map_elem_t *default_entry = mp_map_lookup(kw_args, MP_OBJ_NEW_QSTR(MP_QSTR_default), MP_MAP_LOOKUP);
    if (default_entry) {
        remaining--;
        value = mp_obj_get_int_truncated(default_entry->value);
    }

