malcolm-sparkfun/micropython/ports/mimxrt/mimxrt_csi.c
    for (mp_uint_t i = 0; i < field_count; i++) {
        mp_map_elem_t *field_entry = mp_map_lookup(
            kw_args,
            MP_OBJ_NEW_QSTR(fields_table[i].name),
            MP_MAP_LOOKUP
            );
        if (field_entry) {
            remaining--;
            mp_uint_t field_value = mp_obj_get_int_truncated(field_entry->value);
            mp_uint_t mask = ((1 << fields_table[i].length) - 1);
            mp_uint_t masked_value = field_value & mask;
            if (field_value != masked_value) {
                mp_raise_ValueError(MP_ERROR_TEXT("bad field value"));
            }
            value &= ~(mask << fields_table[i].shift);
            value |= masked_value << fields_table[i].shift;
        }
    }

    if (remaining) {
        mp_raise_TypeError(NULL);
    }

    return mp_obj_new_int_from_uint(value);
}

static mp_obj_t mimxrt_csi_unpack_reg(mp_obj_t value_obj, mimxrt_csi_field_t *fields_table, uint32_t field_count) {
    // Return a dict representing the unpacked fields of a control register value
    mp_obj_t result_dict[field_count * 2];

    mp_uint_t value = mp_obj_get_int_truncated(value_obj);

    for (mp_uint_t i = 0; i < field_count; i++) {
        result_dict[i * 2] = MP_OBJ_NEW_QSTR(fields_table[i].name);
        mp_uint_t field_value =
            (value >> fields_table[i].shift) & ((1 << fields_table[i].length) - 1);
        result_dict[i * 2 + 1] = MP_OBJ_NEW_SMALL_INT(field_value);
    }

    return mp_obj_dict_make_new(&mp_type_dict, 0, field_count, result_dict);
}

// ------------------------------- Packing Functions (CSI.pack_...) ------------------------------- 
static mp_obj_t mimxrt_csi_pack_cr1(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    return mimxrt_csi_pack_reg(n_args, kw_args, DEFAULT_CSI_CR1, mimxrt_csi_cr1_fields_table, mimxrt_csi_cr1_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_KW(mimxrt_csi_pack_cr1_obj, 1, mimxrt_csi_pack_cr1);

static mp_obj_t mimxrt_csi_pack_cr2(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    return mimxrt_csi_pack_reg(n_args, kw_args, DEFAULT_CSI_CR2, mimxrt_csi_cr2_fields_table, mimxrt_csi_cr2_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_KW(mimxrt_csi_pack_cr2_obj, 1, mimxrt_csi_pack_cr2);

static mp_obj_t mimxrt_csi_pack_cr3(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    return mimxrt_csi_pack_reg(n_args, kw_args, DEFAULT_CSI_CR3, mimxrt_csi_cr3_fields_table, mimxrt_csi_cr3_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_KW(mimxrt_csi_pack_cr3_obj, 1, mimxrt_csi_pack_cr3);

static mp_obj_t mimxrt_csi_pack_rxcnt(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    return mimxrt_csi_pack_reg(n_args, kw_args, 0u, mimxrt_csi_rxcnt_fields_table, mimxrt_csi_rxcnt_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_KW(mimxrt_csi_pack_rxcnt_obj, 1, mimxrt_csi_pack_rxcnt);

static mp_obj_t mimxrt_csi_pack_sr(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    return mimxrt_csi_pack_reg(n_args, kw_args, 0u, mimxrt_csi_sr_fields_table, mimxrt_csi_sr_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_KW(mimxrt_csi_pack_sr_obj, 1, mimxrt_csi_pack_sr);

static mp_obj_t mimxrt_csi_pack_dmasa_statfifo(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    return mimxrt_csi_pack_reg(n_args, kw_args, 0u, mimxrt_csi_dmasa_statfifo_fields_table, mimxrt_csi_dmasa_statfifo_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_KW(mimxrt_csi_pack_dmasa_statfifo_obj, 1, mimxrt_csi_pack_dmasa_statfifo);

static mp_obj_t mimxrt_csi_pack_dmats_statfifo(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    return mimxrt_csi_pack_reg(n_args, kw_args, 0u, mimxrt_csi_dmats_statfifo_fields_table, mimxrt_csi_dmats_statfifo_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_KW(mimxrt_csi_pack_dmats_statfifo_obj, 1, mimxrt_csi_pack_dmats_statfifo);

static mp_obj_t mimxrt_csi_pack_dmasa_fb1(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    return mimxrt_csi_pack_reg(n_args, kw_args, 0u, mimxrt_csi_dmasa_fb1_fields_table, mimxrt_csi_dmasa_fb1_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_KW(mimxrt_csi_pack_dmasa_fb1_obj, 1, mimxrt_csi_pack_dmasa_fb1);

static mp_obj_t mimxrt_csi_pack_dmasa_fb2(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    return mimxrt_csi_pack_reg(n_args, kw_args, 0u, mimxrt_csi_dmasa_fb2_fields_table, mimxrt_csi_dmasa_fb2_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_KW(mimxrt_csi_pack_dmasa_fb2_obj, 1, mimxrt_csi_pack_dmasa_fb2);

static mp_obj_t mimxrt_csi_pack_fbuf_para(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    return mimxrt_csi_pack_reg(n_args, kw_args, DEFAULT_CSI_REG_FBUF_PARA, mimxrt_csi_fbuf_para_fields_table, mimxrt_csi_fbuf_para_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_KW(mimxrt_csi_pack_fbuf_para_obj, 1, mimxrt_csi_pack_fbuf_para);

static mp_obj_t mimxrt_csi_pack_imag_para(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    return mimxrt_csi_pack_reg(n_args, kw_args, DEFAULT_CSI_REG_IMAG_PARA, mimxrt_csi_imag_para_fields_table, mimxrt_csi_imag_para_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_KW(mimxrt_csi_pack_imag_para_obj, 1, mimxrt_csi_pack_imag_para);

static mp_obj_t mimxrt_csi_pack_cr18(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    return mimxrt_csi_pack_reg(n_args, kw_args, DEFAULT_CSI_CR18, mimxrt_csi_cr18_fields_table, mimxrt_csi_cr18_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_KW(mimxrt_csi_pack_cr18_obj, 1, mimxrt_csi_pack_cr18);

static mp_obj_t mimxrt_csi_pack_cr19(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    return mimxrt_csi_pack_reg(n_args, kw_args, 0u, mimxrt_csi_cr19_fields_table, mimxrt_csi_cr19_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_KW(mimxrt_csi_pack_cr19_obj, 1, mimxrt_csi_pack_cr19);

// -------------------------------  Unpacking functions (CSI.unpack_...) ------------------------------- 
static mp_obj_t mimxrt_csi_unpack_cr1(mp_obj_t self_in, mp_obj_t value_obj) {
    return mimxrt_csi_unpack_reg(value_obj, mimxrt_csi_cr1_fields_table, mimxrt_csi_cr1_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_2(mimxrt_csi_unpack_cr1_obj, mimxrt_csi_unpack_cr1);

