malcolm-sparkfun/micropython/ports/mimxrt/mimxrt_csi.c
static mp_obj_t mimxrt_csi_unpack_cr2(mp_obj_t self_in, mp_obj_t value_obj) {
    return mimxrt_csi_unpack_reg(value_obj, mimxrt_csi_cr2_fields_table, mimxrt_csi_cr2_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_2(mimxrt_csi_unpack_cr2_obj, mimxrt_csi_unpack_cr2);

static mp_obj_t mimxrt_csi_unpack_cr3(mp_obj_t self_in, mp_obj_t value_obj) {
    return mimxrt_csi_unpack_reg(value_obj, mimxrt_csi_cr3_fields_table, mimxrt_csi_cr3_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_2(mimxrt_csi_unpack_cr3_obj, mimxrt_csi_unpack_cr3);

static mp_obj_t mimxrt_csi_unpack_rxcnt(mp_obj_t self_in, mp_obj_t value_obj) {
    return mimxrt_csi_unpack_reg(value_obj, mimxrt_csi_rxcnt_fields_table, mimxrt_csi_rxcnt_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_2(mimxrt_csi_unpack_rxcnt_obj, mimxrt_csi_unpack_rxcnt);

static mp_obj_t mimxrt_csi_unpack_sr(mp_obj_t self_in, mp_obj_t value_obj) {
    return mimxrt_csi_unpack_reg(value_obj, mimxrt_csi_sr_fields_table, mimxrt_csi_sr_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_2(mimxrt_csi_unpack_sr_obj, mimxrt_csi_unpack_sr);

static mp_obj_t mimxrt_csi_unpack_dmasa_statfifo(mp_obj_t self_in, mp_obj_t value_obj) {
    return mimxrt_csi_unpack_reg(value_obj, mimxrt_csi_dmasa_statfifo_fields_table, mimxrt_csi_dmasa_statfifo_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_2(mimxrt_csi_unpack_dmasa_statfifo_obj, mimxrt_csi_unpack_dmasa_statfifo);

static mp_obj_t mimxrt_csi_unpack_dmats_statfifo(mp_obj_t self_in, mp_obj_t value_obj) {
    return mimxrt_csi_unpack_reg(value_obj, mimxrt_csi_dmats_statfifo_fields_table, mimxrt_csi_dmats_statfifo_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_2(mimxrt_csi_unpack_dmats_statfifo_obj, mimxrt_csi_unpack_dmats_statfifo);

static mp_obj_t mimxrt_csi_unpack_dmasa_fb1(mp_obj_t self_in, mp_obj_t value_obj) {
    return mimxrt_csi_unpack_reg(value_obj, mimxrt_csi_dmasa_fb1_fields_table, mimxrt_csi_dmasa_fb1_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_2(mimxrt_csi_unpack_dmasa_fb1_obj, mimxrt_csi_unpack_dmasa_fb1);

static mp_obj_t mimxrt_csi_unpack_dmasa_fb2(mp_obj_t self_in, mp_obj_t value_obj) {
    return mimxrt_csi_unpack_reg(value_obj, mimxrt_csi_dmasa_fb2_fields_table, mimxrt_csi_dmasa_fb2_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_2(mimxrt_csi_unpack_dmasa_fb2_obj, mimxrt_csi_unpack_dmasa_fb2);

static mp_obj_t mimxrt_csi_unpack_fbuf_para(mp_obj_t self_in, mp_obj_t value_obj) {
    return mimxrt_csi_unpack_reg(value_obj, mimxrt_csi_fbuf_para_fields_table, mimxrt_csi_fbuf_para_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_2(mimxrt_csi_unpack_fbuf_para_obj, mimxrt_csi_unpack_fbuf_para);

static mp_obj_t mimxrt_csi_unpack_imag_para(mp_obj_t self_in, mp_obj_t value_obj) {
    return mimxrt_csi_unpack_reg(value_obj, mimxrt_csi_imag_para_fields_table, mimxrt_csi_imag_para_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_2(mimxrt_csi_unpack_imag_para_obj, mimxrt_csi_unpack_imag_para);

static mp_obj_t mimxrt_csi_unpack_cr18(mp_obj_t self_in, mp_obj_t value_obj) {
    return mimxrt_csi_unpack_reg(value_obj, mimxrt_csi_cr18_fields_table, mimxrt_csi_cr18_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_2(mimxrt_csi_unpack_cr18_obj, mimxrt_csi_unpack_cr18);

static mp_obj_t mimxrt_csi_unpack_cr19(mp_obj_t self_in, mp_obj_t value_obj) {
    return mimxrt_csi_unpack_reg(value_obj, mimxrt_csi_cr19_fields_table, mimxrt_csi_cr19_field_count);
}
static MP_DEFINE_CONST_FUN_OBJ_2(mimxrt_csi_unpack_cr19_obj, mimxrt_csi_unpack_cr19);

static const mp_rom_map_elem_t mimxrt_csi_locals_dict_table[] = {
    // { MP_ROM_QSTR(MP_QSTR_foo), MP_ROM_PTR(&mimxrt_csi_foo_obj) },
    // register accessors
    { MP_ROM_QSTR(MP_QSTR_cr1), MP_ROM_PTR(&mimxrt_csi_cr1_obj) },
    { MP_ROM_QSTR(MP_QSTR_cr2), MP_ROM_PTR(&mimxrt_csi_cr2_obj) },
    { MP_ROM_QSTR(MP_QSTR_cr3), MP_ROM_PTR(&mimxrt_csi_cr3_obj) },
    { MP_ROM_QSTR(MP_QSTR_statfifo), MP_ROM_PTR(&mimxrt_csi_statfifo_obj) },
    { MP_ROM_QSTR(MP_QSTR_rfifo), MP_ROM_PTR(&mimxrt_csi_rfifo_obj) },
    { MP_ROM_QSTR(MP_QSTR_rxcnt), MP_ROM_PTR(&mimxrt_csi_rxcnt_obj) },
    { MP_ROM_QSTR(MP_QSTR_sr), MP_ROM_PTR(&mimxrt_csi_sr_obj) },
    { MP_ROM_QSTR(MP_QSTR_dmasa_statfifo), MP_ROM_PTR(&mimxrt_csi_dmasa_statfifo_obj) },
    { MP_ROM_QSTR(MP_QSTR_dmats_statfifo), MP_ROM_PTR(&mimxrt_csi_dmats_statfifo_obj) },
    { MP_ROM_QSTR(MP_QSTR_dmasa_fb1), MP_ROM_PTR(&mimxrt_csi_dmasa_fb1_obj) },
    { MP_ROM_QSTR(MP_QSTR_dmasa_fb2), MP_ROM_PTR(&mimxrt_csi_dmasa_fb2_obj) },
    { MP_ROM_QSTR(MP_QSTR_fbuf_para), MP_ROM_PTR(&mimxrt_csi_fbuf_para_obj) },
    { MP_ROM_QSTR(MP_QSTR_imag_para), MP_ROM_PTR(&mimxrt_csi_imag_para_obj) },
    { MP_ROM_QSTR(MP_QSTR_cr18), MP_ROM_PTR(&mimxrt_csi_cr18_obj) },
    { MP_ROM_QSTR(MP_QSTR_cr19), MP_ROM_PTR(&mimxrt_csi_cr19_obj) },

    // packing functions
    { MP_ROM_QSTR(MP_QSTR_pack_cr1), MP_ROM_PTR(&mimxrt_csi_pack_cr1_obj) },
    { MP_ROM_QSTR(MP_QSTR_pack_cr2), MP_ROM_PTR(&mimxrt_csi_pack_cr2_obj) },
    { MP_ROM_QSTR(MP_QSTR_pack_cr3), MP_ROM_PTR(&mimxrt_csi_pack_cr3_obj) },
    { MP_ROM_QSTR(MP_QSTR_pack_rxcnt), MP_ROM_PTR(&mimxrt_csi_pack_rxcnt_obj) },
    { MP_ROM_QSTR(MP_QSTR_pack_sr), MP_ROM_PTR(&mimxrt_csi_pack_sr_obj) },
    { MP_ROM_QSTR(MP_QSTR_pack_dmasa_statfifo), MP_ROM_PTR(&mimxrt_csi_pack_dmasa_statfifo_obj) },
    { MP_ROM_QSTR(MP_QSTR_pack_dmats_statfifo), MP_ROM_PTR(&mimxrt_csi_pack_dmats_statfifo_obj) },
    { MP_ROM_QSTR(MP_QSTR_pack_dmasa_fb1), MP_ROM_PTR(&mimxrt_csi_pack_dmasa_fb1_obj) },
    { MP_ROM_QSTR(MP_QSTR_pack_dmasa_fb2), MP_ROM_PTR(&mimxrt_csi_pack_dmasa_fb2_obj) },
    { MP_ROM_QSTR(MP_QSTR_pack_fbuf_para), MP_ROM_PTR(&mimxrt_csi_pack_fbuf_para_obj) },
    { MP_ROM_QSTR(MP_QSTR_pack_imag_para), MP_ROM_PTR(&mimxrt_csi_pack_imag_para_obj) },
    { MP_ROM_QSTR(MP_QSTR_pack_cr18), MP_ROM_PTR(&mimxrt_csi_pack_cr18_obj) },
    { MP_ROM_QSTR(MP_QSTR_pack_cr19), MP_ROM_PTR(&mimxrt_csi_pack_cr19_obj) },

    // unpacking functions
    { MP_ROM_QSTR(MP_QSTR_unpack_cr1), MP_ROM_PTR(&mimxrt_csi_unpack_cr1_obj) },
    { MP_ROM_QSTR(MP_QSTR_unpack_cr2), MP_ROM_PTR(&mimxrt_csi_unpack_cr2_obj) },
    { MP_ROM_QSTR(MP_QSTR_unpack_cr3), MP_ROM_PTR(&mimxrt_csi_unpack_cr3_obj) },
    { MP_ROM_QSTR(MP_QSTR_unpack_rxcnt), MP_ROM_PTR(&mimxrt_csi_unpack_rxcnt_obj) },
    { MP_ROM_QSTR(MP_QSTR_unpack_sr), MP_ROM_PTR(&mimxrt_csi_unpack_sr_obj) },
    { MP_ROM_QSTR(MP_QSTR_unpack_dmasa_statfifo), MP_ROM_PTR(&mimxrt_csi_unpack_dmasa_statfifo_obj) },
    { MP_ROM_QSTR(MP_QSTR_unpack_dmats_statfifo), MP_ROM_PTR(&mimxrt_csi_unpack_dmats_statfifo_obj) },
    { MP_ROM_QSTR(MP_QSTR_unpack_dmasa_fb1), MP_ROM_PTR(&mimxrt_csi_unpack_dmasa_fb1_obj) },
    { MP_ROM_QSTR(MP_QSTR_unpack_dmasa_fb2), MP_ROM_PTR(&mimxrt_csi_unpack_dmasa_fb2_obj) },
    { MP_ROM_QSTR(MP_QSTR_unpack_fbuf_para), MP_ROM_PTR(&mimxrt_csi_unpack_fbuf_para_obj) },
    { MP_ROM_QSTR(MP_QSTR_unpack_imag_para), MP_ROM_PTR(&mimxrt_csi_unpack_imag_para_obj) },
    { MP_ROM_QSTR(MP_QSTR_unpack_cr18), MP_ROM_PTR(&mimxrt_csi_unpack_cr18_obj) },
    { MP_ROM_QSTR(MP_QSTR_unpack_cr19), MP_ROM_PTR(&mimxrt_csi_unpack_cr19_obj) },
};

static MP_DEFINE_CONST_DICT(mimxrt_csi_locals_dict, mimxrt_csi_locals_dict_table);

MP_DEFINE_CONST_OBJ_TYPE(
    mimxrt_csi_type,
    MP_QSTR_CSI,
    MP_TYPE_FLAG_NONE,
    make_new, mimxrt_csi_make_new,
    locals_dict, &mimxrt_csi_locals_dict
);

